<template>
  <p>比如热饮只能做常规杯，冰饮只能加椰果，就无法选择相关的sku组合</p>
  <SkuChoose v-bind="skuChooseProps" />
</template>

<script setup lang="ts">
import SkuChoose from 'hilbert-vue3-ui/SkuChoose'
import 'hilbert-vue3-ui/SkuChoose/style'
import type { SkuChooseProps } from 'hilbert-vue3-ui'

const skuChooseProps: SkuChooseProps = {
  specList: [
    { title: '规格', list: ['常规', '大杯'] },
    { title: '状态', list: ['冰', '热'] },
    { title: '甜度', list: ['标准糖', '半糖', '无糖'] },
    { title: '小料', list: ['珍珠', '椰果', '红豆'] },
  ],
  specCombinationList: [
    // { id: '1', specs: ["常规", "冰", "标准糖", "珍珠"] },
    { id: '2', specs: ["常规", "冰", "标准糖", "椰果"] },
    // { id: '3', specs: ["常规", "冰", "标准糖", "红豆"] },
    // { id: '4', specs: ["常规", "冰", "半糖",  "珍珠"] },
    { id: '5', specs: ["常规", "冰", "半糖",  "椰果"] },
    // { id: '6', specs: ["常规", "冰", "半糖",  "红豆"] },
    // { id: '7', specs: ["常规", "冰", "无糖",  "珍珠"] },
    { id: '8', specs: ["常规", "冰", "无糖",  "椰果"] },
    // { id: '9', specs: ["常规", "冰", "无糖",  "红豆"] },
    { id: '10', specs: ["常规", "热", "标准糖", "珍珠"] },
    { id: '11', specs: ["常规", "热", "标准糖", "椰果"] },
    { id: '12', specs: ["常规", "热", "标准糖", "红豆"] },
    { id: '13', specs: ["常规", "热", "半糖",  "珍珠"] },
    { id: '14', specs: ["常规", "热", "半糖",  "椰果"] },
    { id: '15', specs: ["常规", "热", "半糖",  "红豆"] },
    { id: '16', specs: ["常规", "热", "无糖",  "珍珠"] },
    { id: '17', specs: ["常规", "热", "无糖",  "椰果"] },
    { id: '18', specs: ["常规", "热", "无糖",  "红豆"] },
    // { id: '19', specs: ["大杯", "冰", "标准糖", "珍珠"] },
    { id: '20', specs: ["大杯", "冰", "标准糖", "椰果"] },
    // { id: '21', specs: ["大杯", "冰", "标准糖", "红豆"] },
    // { id: '22', specs: ["大杯", "冰", "半糖",  "珍珠"] },
    { id: '23', specs: ["大杯", "冰", "半糖",  "椰果"] },
    // { id: '24', specs: ["大杯", "冰", "半糖",  "红豆"] },
    // { id: '25', specs: ["大杯", "冰", "无糖",  "珍珠"] },
    { id: '26', specs: ["大杯", "冰", "无糖",  "椰果"] },
    // { id: '27', specs: ["大杯", "冰", "无糖",  "红豆"] },
    // { id: '28', specs: ["大杯", "热", "标准糖", "珍珠"] },
    // { id: '29', specs: ["大杯", "热", "标准糖", "椰果"] },
    // { id: '30', specs: ["大杯", "热", "标准糖", "红豆"] },
    // { id: '31', specs: ["大杯", "热", "半糖",  "珍珠"] },
    // { id: '32', specs: ["大杯", "热", "半糖",  "椰果"] },
    // { id: '33', specs: ["大杯", "热", "半糖",  "红豆"] },
    // { id: '34', specs: ["大杯", "热", "无糖",  "珍珠"] },
    // { id: '35', specs: ["大杯", "热", "无糖",  "椰果"] },
    // { id: '36', specs: ["大杯", "热", "无糖",  "红豆"] }
  ],
}
</script>
